create database wssd;   //创建数据库

show databases;    //显示所有的数据库

select database();   //查看当前所在数据库

use wssd;   //打开数据库

//用户表
create table users(
    id int not null primary key auto_increment,
    username varchar(32) not null,
    name varchar(16) not null,
    pass char(32) not null,
    sex tinyint(1),
    state tinyint(1),
    addtime varchar(16)
);
-- insert into users(username,name,pass,sex,address,code,phone,email,state,addtime) value(?,?,?,?,?,?,?,?,?,?)'
//类型表
create table type(
    id int primary key auto_increment,
    name varchar(32),
    pid int,
    path varchar(255)
);

//商品表
create table goods(
    id int not null primary key auto_increment,
    picname varchar(255),
    typeid int,
    book varchar(64),
    descr text,
    press varchar(32),
    author varchar(32),
    publicationtime varchar(16),
    numbers int,
    isbn varchar(18),
    oldprice double(6,2),
    price double(6,2),
    state tinyint(1),
    store int,
    addtime varchar(16),
    foreign key (typeid) references type(typeid)
);

//订单表
create table orders(
    id int unsigned auto_increment primary key,
    uid int not null,
    order_number varchar(64) unique not null,
    order_pay varchar(64),
    cgn_id int,
    total double(6,2),
    status tinyint(1) not null,
    addtime varchar(64) not null,
    cgn_name varchar(64) not null,
    cgn_tel varchar(64) not null,
    cgn_address varchar(64) not null,
    foreign key (cgn_id) references consignee(cgn_id),
    foreign key (uid) references users(id)
);

//订单详情表
create table detail(
    id int unsigned auto_increment primary key,
    orderid int not null,
    bookid int not null,
    price double(6,2) not null,
    num int not null,
    allprice double(6,2) not null,
    foreign key (orderid) references orders(order_number)
);

//购物车存放表
create table gwc(
    id int unsigned auto_increment primary key,
    bookname varchar(64),
    user varchar(16),
    imgs varchar(255),
    price double(6,2),
    num int,
    allprice double(6,2),
    url varchar(64)
);

//收货人地址表
create table consignee(
    cgn_id int unsigned auto_increment primary key,
    user_id int not null,
    cgn_name varchar(32),
    cgn_province varchar(32), 
    cgn_city varchar(32), 
    cgn_area varchar(32), 
    cgn_detail varchar(32),
    cgn_tel varchar(16),
    foreign key (user_id) references users(id)
);

//管理员表
create table adminlist(
     id int unsigned auto_increment primary key,
     name varchar(16) not null,
     adname varchar(32) not null,
     pass char(32) not null 
);
insert into adminlist value(null,'admin','admin','admin');

insert into type  values(null,'教育','0','0,'),
                        (null,'文学','0','0,'),
                        (null,'人文社科','0','0,'),
                        (null,'艺术','0','0,'),
                        (null,'生活','0','0,'),
                        (null,'传记','0','0,'),
                        (null,'食谱','0','0,'),
                        (null,'工程','0','0,'),
                        (null,'小说','2','0,2,'),
                        (null,'文学','2','0,2,'),
                        (null,'青春文学','2','0,2,'),
                        (null,'历史','3','0,3,'),
                        (null,'文化','3','0,3,'),
                        (null,'法律','3','0,3,'),
                        (null,'古籍','3','0,3,'),
                        (null,'政治/军事','3','0,3,'),
                        (null,'社会科学','3','0,3,'),
                        (null,'成功/励志','0','0'),
                        (null,'经济','0','0'),
                        (null,'心理学','0','0'),
                        (null,'少儿童书','0','0'),
                        (null,'有声读物','0','0');








                        商品id 图片名 类别id 图书名称 简介 出版社 作者 出版时间 字数 单价 状态 库存量 添加时间
insert into goods values (null,'http://img3m3.ddimg.cn/73/19/28504153-1_u_3.jpg,http://img3m3.ddimg.cn/73/19/28504153-2_u_3.jpg,http://img3m3.ddimg.cn/73/19/28504153-3_u_3.jpg,http://img3m3.ddimg.cn/73/19/28504153-4_u_3.jpg',9,'人生(茅盾文学奖得主路遥代表作，全新精装版)','茅盾文学奖得主路遥代表作，激励万千读者的文学经典。写出每个年轻人的困境、期待与追求。改变马云人生，陈忠实、贾樟柯推荐。','北京十月文艺出版社','路遥','2020-02',1020020,'9787530217061','45.00','25.80',1,1000,'2020-3-28'),
                        (null,'http://img3m2.ddimg.cn/82/4/28519012-1_u_3.jpg,http://img3m2.ddimg.cn/82/4/28519012-2_u_3.jpg,http://img3m2.ddimg.cn/82/4/28519012-3_u_3.jpg',12,'1918年之疫：被流感改变的世界','1918年那场持续2年的“西班牙流感”，造成超5000万人死亡，堪称史上ZUI大的医疗浩劫。那场疫情中人们犯过的错误也不时为当下敲响警钟，新一轮的全球性传染病再次来袭，我们是否能够有不一样的表现？','上海教育出版社','[英] 凯瑟琳?阿诺德 著 田奥 译','2020-03',1020020,'9787544497695','58.00','29.00',1,1000,'2020-3-28'),
                        (null,'http://img3m3.ddimg.cn/86/10/28523273-1_u_2.jpg,http://img3m3.ddimg.cn/86/10/28523273-2_u_2.jpg,http://img3m3.ddimg.cn/86/10/28523273-3_u_2.jpg,http://img3m3.ddimg.cn/86/10/28523273-4_u_2.jpg',18,'一年顶十年','个人财富与影响力升级指南！樊登、冯仑、任泉、管清友倾力推荐，图书未上市，预订量已突破100000册。战略对了，你的一年顶别人十年！','北京联合出版有限公司','剽悍一只猫','2020-03',130000,'9787559636614','48.00','33.10',1,1000,'2020-3-28'),
                        (null,'http://img3m3.ddimg.cn/89/19/28506743-1_u_6.jpg,http://img3m3.ddimg.cn/89/19/28506743-2_u_6.jpg,http://img3m3.ddimg.cn/89/19/28506743-3_u_6.jpg',6,'林语堂传记典藏版套盒（苏东坡传+武则天传全2册）','千年来始终闪耀在中国历史星空苏东坡；权倾中国达半个世纪之久的武则天。在中华历史长河中，这一臣一君留下不可磨灭的印记，我们有太多理由来去看看那段历史。精装典藏，林语堂独家授权，单本累计销量超过300万册','湖南文艺出版社','林语堂 著,博集天卷 出品','2020-01',1024020,'28506743','126.00','63.00',1,1000,'2020-3-28'),
                        (null,'http://img3m4.ddimg.cn/64/28/23483854-1_u_6.jpg,http://img3m4.ddimg.cn/64/28/23483854-2_u_6.jpg,http://img3m4.ddimg.cn/64/28/23483854-3_u_6.jpg,http://img3m4.ddimg.cn/64/28/23483854-4_u_6.jpg',1,'学前快读600字(全四册)[精选套装]','学龄前儿童四五快读识字书，根据小学语文新课标设计；与小学一年级生字同步，顺利幼小衔接；附赠600个字识字卡；阅读中识字，游戏中记牢，培养自主阅读；社科院研究员、博导范子烨推荐 ','化学工业出版社','李征','2014-06',12020,'9787122204080','96.00','39.30',1,1000,'2020-3-28'),
                        (null,'http://img3m3.ddimg.cn/50/6/28510763-1_u_7.jpg,http://img3m3.ddimg.cn/50/6/28510763-2_u_7.jpg,http://img3m3.ddimg.cn/50/6/28510763-3_u_7.jpg,http://img3m3.ddimg.cn/50/6/28510763-4_u_7.jpg',9,'在路上','从披头士乐队到乔布斯，它改变了无数人的命运，是被鲍勃?迪伦翻烂了的人生“圣经”！《教父》译者姚向辉翻译，书后附赠手绘地图、嬉皮风插画及88页旅行手记！翻开这一本，彻底读透《在路上》！','江苏凤凰文艺出版社','[美]杰克·凯鲁亚克','2020-01',100000,'9787559405609','59.90','29.95',1,1000,'2020-3-28'),
                        (null,'http://img3m5.ddimg.cn/11/7/28511615-1_u_3.jpg,http://img3m5.ddimg.cn/11/7/28511615-2_u_3.jpg,http://img3m5.ddimg.cn/11/7/28511615-3_u_3.jpg,http://img3m5.ddimg.cn/11/7/28511615-4_u_3.jpg',19,'溢出：中国制造未来史','罗振宇2020知识春晚重磅推荐。中国制造业的未来走向如何？作者半年实地考察走访，力证中国制造业优势转移东南亚的逻辑不成立。高全喜刘擎张力奋徐小平邝子平王维嘉管清友推荐。','中信出版社','施展','2020-01',1020020,'9787521713480','69.00','49.60',1,1000,'2020-3-28'),
                        (null,'http://img3m9.ddimg.cn/84/10/28516539-1_u_3.jpg,http://img3m9.ddimg.cn/84/10/28516539-2_u_3.jpg,http://img3m9.ddimg.cn/84/10/28516539-3_u_3.jpg,http://img3m9.ddimg.cn/84/10/28516539-4_u_3.jpg',11,'完美关系','（黄轩、佟丽娅领衔主演电视剧《完美关系》原著小说，同名电视剧即将登陆湖南卫视首播！ 波诡云谲的公关职场、纷杂的感情世界，他始终和她一起，并肩前行·悦读纪·）','青岛出版社','右耳 著, 悦读纪 出品','2020-02',1020020,'9787555286295','65.00','32.20',1,1000,'2020-3-28'),
                        (null,'http://img3m4.ddimg.cn/48/6/28522344-1_u_3.jpg,http://img3m4.ddimg.cn/48/6/28522344-2_u_3.jpg,http://img3m4.ddimg.cn/48/6/28522344-3_u_3.jpg,http://img3m4.ddimg.cn/48/6/28522344-4_u_3.jpg',15,'饮冰室合集上·饮冰室文集（全12册，简体横排版）：读懂梁启超，读懂现代中国','','北京日报出版社（原同心出版社）','梁启超','2020-01',1020020,'9787547733349','698.00','349.00',1,1000,'2020-3-28'),
                        (null,'http://img3m6.ddimg.cn/31/20/28509556-1_u_4.jpg,http://img3m6.ddimg.cn/31/20/28509556-2_u_4.jpg,http://img3m6.ddimg.cn/31/20/28509556-3_u_4.jpg,http://img3m6.ddimg.cn/31/20/28509556-4_u_4.jpg',2,'余光中、丰子恺、沈从文、老舍“回不去的故乡”系列散文集【全四册】','教育部推荐中小学必读名家散文，精选华语文坛泰斗余光中、丰子恺、沈从文、老舍怀旧思乡经典篇目。每个人的灵魂都在回归故乡的路上，心所安处是吾乡；名家水彩、风俗画，重现故乡梦。精美四色套装，品读典藏。','时代文艺出版社','余光中、丰子恺、沈从文、老舍等 著，卞家华、汪钰元、季全保等 绘','2020-03',1020020,'9787538759877','180.00','81.00',1,1000,'2020-3-28'),
                        (null,'http://img3m8.ddimg.cn/71/12/28517318-1_u_6.jpg,http://img3m8.ddimg.cn/71/12/28517318-2_u_6.jpg,http://img3m8.ddimg.cn/71/12/28517318-3_u_6.jpg,http://img3m8.ddimg.cn/71/12/28517318-4_u_6.jpg',21,'奇趣大课堂限定装（共5册）化学、物理、数学、生物、科学实验','3-10岁一套书让孩子爱上数、理、化、生！立体，翻翻，拉拉多种互动形式；随书附赠全新“互动探秘宝图”，全面的“奇趣大课堂”系列将理科知识一网打尽！乐乐趣科普立体书','陕西人民教育出版社','[英]汤姆?亚当斯 文[英]乔纳森·利腾 文[西]托马斯?弗林萨姆 图 乐乐趣 编译','2020-02',1020020,'28517318','660.00','330.00',1,1000,'2020-3-28'),
                        (null,'http://img3m9.ddimg.cn/81/32/28509309-1_w_3.jpg,http://img3m9.ddimg.cn/81/32/28509309-2_w_3.jpg',11,'庆余年（套装1-3）','【套装包括：远来是客+人在京都+北海有雾，并赠送24张明信片】陈道明、张若昀、吴刚、李沁、郭麒麟、肖战主演电视剧原著小说修订版。人民文学出版社出品。','人民文学出版社','猫腻','2019-12',1020020,'28509309','117.00','117.00',1,1000,'2020-3-28'),
                        (null,'http://img3m8.ddimg.cn/26/0/28519748-1_u_2.jpg,http://img3m8.ddimg.cn/26/0/28519748-2_u_2.jpg,http://img3m8.ddimg.cn/26/0/28519748-3_u_2.jpg,http://img3m8.ddimg.cn/26/0/28519748-4_u_2.jpg',9,'生吞','随机签名版。解谜十七岁少女奸杀案的背后，一段深埋在五个少男少女间的残酷青春往事。“幽暗人生里，你是wei一的星光”。','浙江文艺出版社','郑执','2020-03',1020020,'9787533950057','42.00','20.80',1,1000,'2020-3-28'),
                        (null,'http://img3m6.ddimg.cn/9/6/28519236-1_u_2.jpg,http://img3m6.ddimg.cn/9/6/28519236-2_u_2.jpg,http://img3m6.ddimg.cn/9/6/28519236-3_u_2.jpg,http://img3m6.ddimg.cn/9/6/28519236-4_u_2.jpg',20,'隐藏的人格：揭开人格面具的秘密,探寻真实的自我','中国医学心理学之父李心天爱徒、国际人格面具研究院院长黄国胜20年咨询经验巨献！深入剖析人们内心的冲突,揭秘完美主义、讨好型人格、焦虑、抑郁等诸多心理问题的真正成因 。著名心理咨询师李孟潮作序推荐! ','群言出版社','黄国胜','2020-02',1020020,'9787519305789','45.80','23.40',1,1000,'2020-3-28'),
                        (null,'https://img3.xinhuashudian.com/images/2019/12/06/ac0cbe14-96ea-4db4-aa88-3926cfa2f706.jpg',9,'梦幻花','《梦幻花》以几个突发事件为谜题：一对恩爱夫妻在上班路上被砍杀，留下了嗷嗷待哺的幼女；一个正值青春年少的电子琴乐手跳楼自杀，留下此生未完成的梦想；一个独居的老人被人杀死在家里，家里被翻乱，却没有丢失钱财……看似毫无关联的突发事件，因为一包花种的丢失而串连一起，原来，事情的根由是缘于一盆神秘的牵牛花。“寻找人间不存在的禁断之花，千万不要去寻找黄色的牵牛花”——神秘的留言到底意味着什么？','磨铁出版社','东野圭吾','2015-01-01',1020020,'9787559632241','46.80','41.31',1,1000,'2020-3-28'),
                        (null,'http://img3m5.ddimg.cn/51/34/26921715-1_u_2.jpg,http://img3m5.ddimg.cn/51/34/26921715-2_u_2.jpg,http://img3m5.ddimg.cn/51/34/26921715-3_u_2.jpg,http://img3m5.ddimg.cn/51/34/26921715-4_u_2.jpg',9,'人生海海','60天发行60万册！茅盾文学奖得主麦家力作！豆瓣zui受关注图书榜虚构类连续六周TOP1。挑战常人不敢落笔之处，解密人性的荒唐与高尚','北京十月文艺出版社','麦家','2019-04',1020020,'9787530219218','55.00','27.50',1,1000,'2020-3-28'),
                        (null,'http://img3m5.ddimg.cn/43/2/28496995-1_u_5.jpg,http://img3m5.ddimg.cn/43/2/28496995-2_u_5.jpg,http://img3m5.ddimg.cn/43/2/28496995-3_u_5.jpg,http://img3m5.ddimg.cn/43/2/28496995-4_u_5.jpg',11,'三生三世十里桃花','少量亲笔签名版随机发货。唐七作品，三生三世系列， 白浅和夜华的故事。畅销百万册言情经典作品全新再版，新增作者序言解密【三生】系列未来规划。','文化发展出版社','唐七','2019-12',1020020,'9787514228809','46.00','20.70',1,1000,'2020-3-28'),
                        (null,'http://img3m3.ddimg.cn/95/11/28517243-1_u_9.jpg,http://img3m3.ddimg.cn/95/11/28517243-2_u_9.jpg,http://img3m3.ddimg.cn/95/11/28517243-3_u_9.jpg,http://img3m3.ddimg.cn/95/11/28517243-4_u_9.jpg',12,'五万年中国简史（套装全2册）','从头一批智人踏上中华大地到20世纪，从基因、语言、气候、地理到政治、军事、文化、经济，来自复旦、南大、中国社科院等院校9位史学名家，为你理清中国上下5万年的来龙去脉。','文汇出版社','姚大力、钱文忠、于赓哲、李山、武黎嵩、仇鹿鸣、吴钩、方志远、马勇著','2020-03',1020020,'28517243','129.80','93.40',1,1000,'2020-3-28'),
                        (null,'http://img3m7.ddimg.cn/63/31/28510677-1_w_3.jpg,http://img3m7.ddimg.cn/63/31/28510677-2_w_3.jpg,http://img3m7.ddimg.cn/63/31/28510677-3_w_3.jpg,http://img3m7.ddimg.cn/63/31/28510677-4_w_3.jpg',5,'收纳，给你变个大房子','本书是中国空间管理行业卞栎淳老师的重磅新作，集合了卞老师自己zui核心的超实用收纳经验和整理心得。也是卞老师结合本土中国家庭的家居情况，为中国家庭量身打造的家庭空间全面收纳指南。这本书中从大的空间整理划分到小的物品收纳方法，一一给出了详尽的解决之道，大空间 小方法的结合，能让家的空间成功扩容30%-50%。你在收纳道路上遇到的全部难题，这本书彻底为你解答。','文化发展出版社','卞栎淳','2020-02',1020020,'9787514228953','55.00','27.50',1,1000,'2020-3-28'),
                        (null,'http://img3m2.ddimg.cn/15/36/23669232-1_u_2.jpg,http://img3m2.ddimg.cn/15/36/23669232-2_u_2.jpg,http://img3m2.ddimg.cn/15/36/23669232-3_u_2.jpg,http://img3m2.ddimg.cn/15/36/23669232-4_u_2.jpg',4,'卢浮宫','（历时10年、30种文字发行、卢浮宫5任馆长联合编辑，8开超巨幅呈现， 打开一座365天只为您一个人开放的卢浮宫）','北京美术摄影出版社','［法］布列-布提','2015-4',1020020,'9787805017259','998.00','474.10',1,1000,'2020-3-28'),
                        (null,'http://img3m1.ddimg.cn/19/4/27903961-1_u_5.jpg,http://img3m1.ddimg.cn/19/4/27903961-2_u_5.jpg,http://img3m1.ddimg.cn/19/4/27903961-3_u_5.jpg,http://img3m1.ddimg.cn/19/4/27903961-4_u_5.jpg',21,'迷人的逻辑思维游戏书（全3册）','200堂思维游戏课，200个经典文化故事，激活6-13岁孩子的逻辑脑。让孩子由点状思维状态上升到线性思维的思考方式。全面锻炼孩子的逻辑推理力、分析判断力、空间想象力、观察计算力、专注力。','北京日报出版社（原同心出版社）','一米阳光童书馆','2019-09',10000,'9787547733721','138.00','69.00',1,1000,'2020-3-28'),
                        (null,'http://img3m4.ddimg.cn/70/9/27919654-1_u_9.jpg,http://img3m4.ddimg.cn/70/9/27919654-2_u_9.jpg,http://img3m4.ddimg.cn/70/9/27919654-3_u_9.jpg,http://img3m4.ddimg.cn/70/9/27919654-4_u_9.jpg',21,'北斗儿童地理百科全书 世界地理地图+中国地理地图（套装2册）','全球畅销童书，藏在地图里的地理百科全书，内容紧扣小学课本，超大信息量，拓展孩子思维，让孩子足不出户看世界！从小看世界，方有世界观！“走遍中国、环游世界”从这套书开始！--北斗童书出品','山东省地图出版社','迪啵尔儿童趣味地图班 ','2019-08',10000,'9787557206048','276.00','138.00',1,1000,'2020-3-28'),
                        (null,'http://img3m3.ddimg.cn/63/16/27909153-1_u_6.jpg,http://img3m3.ddimg.cn/63/16/27909153-2_u_6.jpg,http://img3m3.ddimg.cn/63/16/27909153-3_u_6.jpg,http://img3m3.ddimg.cn/63/16/27909153-4_u_6.jpg',21,'汉声数学图画书（全41册+《妈妈手册》）','教育局推荐在线课堂绘本教材，完美补充现行小学数学课程，帮孩子建立受益一生的数学思维 世界一流数学家、凯迪克大奖画家共同打造','天地出版社','[美]明德尔·西托默，哈利·西托默，富兰克林·布朗利','2019-10',10000,'27909153','1230.0','615.00',1,1000,'2020-3-28'),
                        (null,'http://img3m5.ddimg.cn/89/10/25079165-1_u_3.jpg',22,'成语故事','本书运用充满童真童趣的语言，以图文结合、文字注音的方式，讲述了“爱屋及乌”“百步穿杨”“病入膏肓”等60余个人们耳熟能详的成语的由来。全书图画明快活泼，每一篇章末尾附有相应成语释义及成语接龙的游戏，此外大字拼音，有声朗诵，适合儿童阅读。','朝华出版社','弘智','2017-05',1020020,'9787505439436','15.00','13.70',1,1000,'2020-3-28'),
                        (null,'http://img3m8.ddimg.cn/63/9/25079238-1_u_2.jpg',22,'中华美德故事','大图彩绘，画风明快活泼; 大字拼音，适合儿童阅读; 有声朗诵，二维码可识别;故事性强，知识丰富全面。','朝华出版社','弘智','2017-05',1020020,'9787505439559','15.00','13.70',1,1000,'2020-3-28'),
                        (null,'http://img3m3.ddimg.cn/56/26/27899543-1_u_4.jpg,http://img3m3.ddimg.cn/56/26/27899543-2_u_4.jpg,http://img3m3.ddimg.cn/56/26/27899543-3_u_4.jpg,http://img3m3.ddimg.cn/56/26/27899543-4_u_4.jpg',22,'汴京之围：北宋末年的外交、战争和人','《中央帝国的财政密码》作者郭建龙重磅新作！万千读者如鲠在喉，不忍细看的靖康之耻，读懂北宋盛衰之变的历史教训','天地出版社','郭建龙','2020-02',1020020,'9787545549447','78.00','34.00',1,1000,'2020-3-28'),
                        (null,'http://img3m7.ddimg.cn/33/15/27943377-1_u_2.jpg',6,'华为没有成功，只有成长：任正非传','','华中科技大学出版社','林超华','2020-02',1020020,'9787568055574','49.80','24.90',1,1000,'2020-3-28'),
                        (null,'http://img3m5.ddimg.cn/68/17/28512365-1_u_6.jpg,http://img3m5.ddimg.cn/68/17/28512365-2_u_6.jpg,http://img3m5.ddimg.cn/68/17/28512365-3_u_6.jpg,http://img3m5.ddimg.cn/68/17/28512365-4_u_6.jpg',9,'美丘','直木奖得主、日本超人气畅销小说作家石田衣良，被日本文坛誉为“现代感觉的妙手”。继《孤独小说家》之后又一感人力作，演绎“池袋西口公园”之外的别样青春。勇敢地爱，绚烂地活。','青岛出版社','石田衣良','2020-01',1020020,'9787555262770','35.00','17.50',1,1000,'2020-3-28'),
                        (null,'http://img3m4.ddimg.cn/28/23/23833684-1_u_2.jpg,http://img3m4.ddimg.cn/28/23/23833684-2_u_2.jpg,http://img3m4.ddimg.cn/28/23/23833684-3_u_2.jpg',18,'每天进步一点点','一本从平凡到卓越的自我管理手册；千万职场人士必读的幸福成功学；每天进步一点点，未来才会有更大的发展！','北京理工大学出版社','马文戈','2015-12',1020020,'9787568214261','29.90','23.60',1,1000,'2020-3-28'),
                        (null,'http://img3m5.ddimg.cn/8/30/23343515-1_u_1.jpg,http://img3m5.ddimg.cn/8/30/23343515-2_u_1.jpg',12,'失落的一代：中国的上山下乡运动1968-1980（增订版）','张抗抗、叶辛、徐友渔、朱学勤、刘小萌联袂推荐。','中国大百科全书出版社','（法）潘鸣啸　著，欧阳因　译','2013-09',1020020,'9787500092445','54.00','27.00',1,1000,'2020-3-28'),
                        (null,'http://img3m7.ddimg.cn/77/26/28479407-1_u_2.jpg,http://img3m7.ddimg.cn/77/26/28479407-2_u_2.jpg,http://img3m7.ddimg.cn/77/26/28479407-3_u_2.jpg,http://img3m7.ddimg.cn/77/26/28479407-4_u_2.jpg',19,'5G时代：生活方式和商业模式的大变革','5G商用正式开启，一本书讲透5G对生活和商务的影响 继《大数据时代》，重磅推出畅销书《5G时代》 日本畅销100000册','浙江人民出版社','【日】龟井卓也','2019-11',1020020,'9787213094880','58.00','29.00',1,1000,'2020-3-28'),
                        (null,'http://img3m6.ddimg.cn/35/15/25111286-1_u_10.jpg,http://img3m6.ddimg.cn/35/15/25111286-2_u_10.jpg,http://img3m6.ddimg.cn/35/15/25111286-3_u_10.jpg,http://img3m6.ddimg.cn/35/15/25111286-4_u_10.jpg',12,'四大名著 青少版插图本','严格依据原著精编精校，特邀名师、教授针对中小学生阅读重点难点，对生僻字注音、知识点加注释，配精美插图，激发阅读兴趣，引导阅读，提高学生对文章的理解能力，众多家长老师认可。余秋雨梅子涵推荐。','民主与建设出版社','（清）曹雪芹、（明）吴承恩、（明）罗贯中、（明）施耐庵 著，高高国际 出品','2017-08',1020020,'25111286','119.20','101.40',1,1000,'2020-3-28'),
                        (null,'http://img3m1.ddimg.cn/2/17/28495271-1_u_6.jpg,http://img3m1.ddimg.cn/2/17/28495271-2_u_6.jpg,http://img3m1.ddimg.cn/2/17/28495271-3_u_6.jpg,http://img3m1.ddimg.cn/2/17/28495271-4_u_6.jpg',5,'亲密关系心理学','深刻探讨亲密关系中复杂矛盾的真相；亲密关系中那些情感暴力、关系黑洞、情绪勒索、行为控制等不可回避的问题，这本书都能从心理学的角度去一一解答；以你想要的方式去爱，只想与你过完这... ','青岛出版社','孙睿盈 著, 悦读纪 出品','2019-12',1020020,'9787555281368','39.80','19.90',1,1000,'2020-3-28'),
                        (null,'http://img3m2.ddimg.cn/80/8/28484162-1_u_5.jpg,http://img3m2.ddimg.cn/80/8/28484162-2_u_5.jpg,http://img3m2.ddimg.cn/80/8/28484162-3_u_5.jpg,http://img3m2.ddimg.cn/80/8/28484162-4_u_5.jpg',20,'墨菲定律','20世纪西方文化三大发现之一，那些无声无息又无所不在支配我们的心理学秘密；有趣又实用的日常行为心理指南，附赠精美心理学知识思维导图。','北方文艺出版社','书鱼','2019-11',1020020,'9787531746430','42.80','15.60',1,1000,'2020-3-28'),
                        (null,'http://img3m9.ddimg.cn/67/35/28496029-1_u_3.jpg,http://img3m9.ddimg.cn/67/35/28496029-2_u_3.jpg,http://img3m9.ddimg.cn/67/35/28496029-3_u_3.jpg,http://img3m9.ddimg.cn/67/35/28496029-4_u_3.jpg',20,'商业模式教科书（高级篇）','如何让定位落地并战胜同定位选手的竞争指南，解密《超越战略》联合作者张振广撰序力推！解密麦肯锡、谷歌、三星、苹果、奈飞、优衣库、GAP等100多家公司的盈利机制','华夏出版社','[日]今枝昌宏 著； 王晗 译','2020-01',1020020,'9787508098340','68.00','34.00',1,1000,'2020-3-28');
